[
  {
    "title": "Haigazian Armenological Review Publishes the first book of Volume 43",
    "text": "The first book of the Haigazian Armenological Review for the year 2023, namely book 43/1 has been published. In its 520 pages, alongside the editorial, entitled “What the Diaspora Armenians Lack: The Role and Influence of the Armenian Scholar”, the book hosts a number of research papers pertaining to arts, folklore, literary criticism, church matters,…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/10/BookCover.jpg",
    "link": "https://www.haigazian.edu.lb/2023/10/06/haigazian-armenological-review-publishes-the-first-book-of-volume-43/",
    "date_created": "Oct, 06"
  },
  {
    "title": "Haigazian University Model United Nations Club (HUMUN) in Barcelona",
    "text": "The Haigazian University Model United Nations Club (HUMUN), after successfully hosting over 310 delegates in March 2023, sent six club members to Barcelona on the 13th of September to participate in the Model United Nations Student Association (MUNSA 2023) Conference at the Pompeu Fabra University. This was the first international representation of Haigazian in an…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/10/MUN1.jpg",
    "link": "https://www.haigazian.edu.lb/2023/10/02/haigazian-university-model-united-nations-club-humun-in-barcelona/",
    "date_created": "Oct, 02"
  },
  {
    "title": "Best Paper Award for Haigazian University",
    "text": "Haigazian University won the Best Paper Award from the Management Consulting Division of the Academy of Management, at the 83rd annual meeting of the Academy of Management, which was held on August 4 – 8, 2023, in Boston, Massachusetts, and attended by 10,000 academicians. The Research paper entitled “Relationship between Traits of Emotional Intelligence and…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/09/BP3.jpeg",
    "link": "https://www.haigazian.edu.lb/2023/09/28/best-paper-award-for-haigazian-university/",
    "date_created": "Sep, 28"
  },
  {
    "title": "Interuniversity Food Waste Awareness Competition",
    "text": "As part of the Food Waste Prevention Awareness project, organized by the Lebanese Ministry of Economy and Trade, and under the close supervision and training of Dr. Sima Hamadeh, Associate Professor of Public Health Nutrition and Program Coordinator of Nutrition & Dietetics Sciences at Haigazian University, two students participated in the “Interuniversity Food waste awareness…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/09/IF1.jpg",
    "link": "https://www.haigazian.edu.lb/2023/09/20/interuniversity-food-waste-awareness-competition/",
    "date_created": "Sep, 20"
  },
  {
    "title": "Empowering Business Schools with Digital Transformation Forum",
    "text": "Dr. Christine Arzoumanian, Lecturer at the Faculty of Business Administration & Economics, and Mr. Vahe Ghorghorian, Assistant ITS Manager at the IT Department, participated at the “Empowering Business Schools with Digital Transformation” forum, which took place in Dubai, UAE from September 5-6, 2023. Among thirteen participating countries from the MENA region, Haigazian University exclusively represented…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/09/DTF1-2308x981.jpg",
    "link": "https://www.haigazian.edu.lb/2023/09/15/empowering-business-schools-with-digital-transformation-forum/",
    "date_created": "Sep, 15"
  },
  {
    "title": "“Moments of Being”",
    "text": "Organized by the UK Office for Syria (UKOS), in partnership with The British Council, a collective art exhibition entitled “Moments of Being”, opened at Haigazian University’s Matossian Gallery on Friday the 8th of September, 2023. The exhibition was inaugurated in a private ceremony a day prior to the official opening, with the presence of the…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/09/MB1.jpg",
    "link": "https://www.haigazian.edu.lb/2023/09/15/4989/",
    "date_created": "Sep, 15"
  },
  {
    "title": "Academic year 2023-2024 Kicks Off",
    "text": "    On Monday the 28th of August, with a big sense of excitement Haigazian University welcomed its new and returning students on campus, thus, officially marking the start of the new academic year 2023 – 2024. Few days before the kickoff, newly enrolled students took part in a thorough full day orientation program, specially…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/09/AY1.jpg",
    "link": "https://www.haigazian.edu.lb/2023/09/01/academic-year-2023-2024-kicks-off/",
    "date_created": "Sep, 01"
  },
  {
    "title": "A $20,000 Memorial Gift to the Haigazian Armenological Review in Honor of the Late Rev. Barkev N. Darakjian",
    "text": "Beirut, 28/8/2023 In honor of the memory and legacy of their late father and grandfather, the Rev. Barkev N. Darakjian (1925-2023), the Darakjian family has allocated, through the Armenian Missionary Association of America (AMAA), a memorial gift totaling to $20,000 to the Haigazian University Armenological Review (HAR). Since its foundation in 1970, the HAR has…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/08/Darakjian-Barkev.jpg",
    "link": "https://www.haigazian.edu.lb/2023/08/29/a-20000-memorial-gift-to-the-haigazian-armenological-review-in-honor-of-the-late-rev-barkev-n-darakjian/",
    "date_created": "Aug, 29"
  },
  {
    "title": "The “Chronicles of Perseverance” Screened at Haigazian University",
    "text": "  Between July 28 and August 11, 2023, and over a period of seven days, Haigazian University had the privilege to host the screening of the “Chronicles of Perseverance”, an event organized by “Hnarti”, a cultural platform dedicated to the exploration of the Armenian heritage through a variety of social, artistic & cultural projects and events.…",
    "thumbnail": "https://www.haigazian.edu.lb/wp-content/uploads/2023/08/CP1.jpg",
    "link": "https://www.haigazian.edu.lb/2023/08/29/the-chronicles-of-perseverance-screened-at-haigazian-university/",
    "date_created": "Aug, 29"
  }
]